Revit 2026 API

# DuplicateTypeNamesHandlerArgs Methods

---

The DuplicateTypeNamesHandlerArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetTypeIds | Returns ids of the types with duplicate names. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DuplicateTypeNamesHandlerArgs Class

Autodesk.Revit.DB Namespace